Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_adc.h
/**************************************************************************//**
 * @file     rtl819bhp_adc.h
 * @brief    The fundamental definition for RTL8735B HP ADC module.
 * @version  V1.00
 * @date     2017-01-15
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#ifndef _RTL8735B_ADC_H_
#define _RTL8735B_ADC_H_

#include "rtl8735b_adc_type.h"

#ifdef  __cplusplus
extern "C"
{
#endif

/**
 * @addtogroup hs_hal_adc ADC
 * @{
 */

#undef ADC_SW_DATA_PATCH
#define ADC_BUSY_PATCH
#undef ADC_LAST_ITEM_PATCH
#undef ADC_DMA_PATCH
#undef ADC_NULL_CHANNEL_PATCH


/*  Macros for adc related constant  */
/// adc total channel number (internal + external)
#define HP_ADC_CH_NO            8
/// adc external channel number (adc4 ~ adc7)
#define HP_ADC_EXCH_NO          4
/// adc dual input channel input number
#define HP_ADC_DUAL_IN_CH       8
/// adc hardware list item number
#define HP_ADC_LIST_LEN         16
/// adc hardware list item number in half
#define HP_ADC_LIST_HALF        8
/// adc IRQ Priority
#define HP_ADC_IRQ_PR           7
/// adc resolution bit number
#define HP_ADC_RESOLUTION       12
/// adc data mask
#define HP_ADC_DATA_MASK        0xFFF
/// adc FIFO length
#define HP_ADC_FIFO_LEN         64
/// adc code max value
#define HP_ADC_CODE_MAX         0xFFF
/// adc rule number
#define HP_ADC_COMP_RULE        4
/// adc default DMA RX des width
#define HP_ADC_DMA_DEFAULT_RX_DES_WIDTH 4
//#define HP_ADC_CHIDX_MASK       0x3C00      /// adc channel index mask
/// adc disable timeout
#define HP_ADC_TIMEOUT_DISABLE  0x0
/// adc endless timeout
#define HP_ADC_TIMEOUT_ENDLESS  0xFFFFFFFF
/// adc input all single-end type
#define HP_ADC_INPUT_ALL_SINGLE 0
/// hp adc calculating scale
#define HP_ADC_CALC_SCLE        1024

/// hp adc constant value
#define HP_ADC_GAIN_DENO_ADDR           0x4A8 // 2 bytes (Start Address is indicated here)
#define HP_ADC_GAIN_MOLE_ADDR           0x4AA // 2 bytes (Start Address is indicated here)
#define HP_ADC_OFFSET_DENO_ADDR         0x4AC // 2 bytes (Start Address is indicated here)
#define HP_ADC_OFFSET_MOLE_ADDR         0x4AE // 4 bytes (Start Address is indicated here)

#define HP_ADC_INTERNAL_R_ADDR     		0x4B2 // 2 bytes (Start Address is indicated here)

#define HP_ADC_BATT_GAIN_DENO_ADDR      0x4B4 // 2 bytes (Start Address is indicated here)
#define HP_ADC_BATT_GAIN_MOLE_ADDR      0x4B6 // 2 bytes (Start Address is indicated here)
#define HP_ADC_BATT_OFFSET_DENO_ADDR    0x4B8 // 4 bytes (Start Address is indicated here)
#define HP_ADC_BATT_OFFSET_MOLE_ADDR    0x4BC // 2 bytes (Start Address is indicated here)

/*  Macros for adc reigster access  */
/** @defgroup adc_reg_access_macro ADC REG ACCESS MACRO
 *  adc register access macro
 *  @{
 */
#define ADC_BASE_REG ((volatile ADC_Type *)(0))
#define HAL_ADC_READ32(base, offset) rtk_le32_to_cpu(*((volatile uint32_t*)(base + offset)))
#define HAL_ADC_WRITE32(base, offset, value) ((*((volatile uint32_t*)(base + offset))) = rtk_cpu_to_le32(value))
#define READ_CLEAR_ADC_REG(base, reg_name)   base->reg_name
/** @} */ // end of ADC REG ACCESS MACRO

/** \brief adc feature status
*/
enum adc_enable_status_e {
	ADCDisable      =   0,                  /*!< 0: for adc disable state    */
	ADCEnable       =   1,                  /*!< 1: for adc enable state    */
};

/** \brief adc conversion trigger mode
*/
enum adc_trigger_mode_e {
	ADCSWTrigMod    =   0,                  /*!< 0: for adc software trigger mode    */
	ADCAutoMod      =   1,                  /*!< 1: for adc automatic trigger mode    */
	ADCTmTrigMod    =   2,                  /*!< 1: for adc timer trigger mode    */
	ADCCompTrigMod  =   3,                  /*!< 1: for adc comparator trigger mode    */ // Defunct in ProII
};

/** \brief adc channel input type
*/
enum adc_input_type_e {
	ADCSingleInput          =   0,          /*!< 0: for adc single end input    */
	ADCDifferentialInput    =   1,          /*!< 1: for adc differential input    */
};

/** \brief adc module state
*/
enum adc_status_e {
	ADCStatusUninitial      =   0x00,               /*!< 0x00: adc uninitialized state   */
	ADCStatusInitialized    =   0x01,               /*!< 0x01: adc initialized state   */
	ADCStatusIdle           =   0x02,               /*!< 0x02: adc idle state   */

	ADCStatusCVReady        =   0x03,               /*!< 0x03: adc conversion ready state   */
	ADCStatusCVing          =   0x04,               /*!< 0x04: adc processing conversion state   */

	ADCStatusError          =   0x10,               /*!< 0x10: adc error state   */
	ADCStatusTimeOut        =   0x11,               /*!< 0x11: adc time-out state   */
};

/** \brief adc module error type
*/
enum adc_err_type_e {
	ADCErrorNone            =   0x00,               /*!< 0x00: adc has no errors    */
	ADCErrorFFOver          =   0x01,               /*!< 0x01: adc has fifo overflow error1    */
	ADCErrorFFUnder         =   0x02,               /*!< 0x02: adc has fifo underflow errors    */
	ADCErrorDatOverWrite    =   0x03,               /*!< 0x03: adc has data over written errors    */
	ADCErrorUnknown         =   0x04,               /*!< 0x04: adc has unknown errors    */
};

/** \brief adc module clock division option
*/
enum adc_clock_div_e {
	ADCClockDiv640          =   0x00,               /*!< 0x00: adc clock is divided by 640   */
	ADCClockDiv800          =   0x01,               /*!< 0x01: adc clock is divided by 800    */
	ADCClockDiv960          =   0x02,               /*!< 0x02: adc clock is divided by 960    */
	ADCClockDiv1120         =   0x03,               /*!< 0x03: adc clock is divided by 1120    */
	ADCClockDiv1280         =   0x04,               /*!< 0x03: adc clock is divided by 1280    */
};

/** \brief adc module reference voltage (vref) settle time
*/

enum adc_vref_settle_time_e {
	ADCVRefSettleTime20     = 0x00,                 /*!< 0x00: adc Vref settle time is 20 us   */
	ADCVRefSettleTime40     = 0x01,                 /*!< 0x01: adc Vref settle time is 40 us   */
	ADCVRefSettleTime80     = 0x02,                 /*!< 0x02: adc Vref settle time is 80 us   */
	ADCVRefSettleTime160    = 0x03,                 /*!< 0x03: adc Vref settle time is 160 us  */
};


/** \brief adc dma channel status
*/
enum adc_dma_ch_status_e {
	ADCDmaChNone            =   0x00,               /*!< 0x00: adc got no channel    */
	ADCDmaChGot             =   0x01,               /*!< 0x01: adc got a channel    */
	ADCDmaChInitialed       =   0x02,               /*!< 0x02: adc got a channel and initialized it    */
};

/** \brief adc interrupt type
*/
enum adc_interrupt_type_e {
	ADCIntrCVlistEnd        =   0x00,               /*!< 0x00: adc conversion list end interrupt    */
	ADCIntrCVEnd            =   0x01,               /*!< 0x01: adc conversion end interrupt    */
	ADCIntrChCVEnd          =   0x02,               /*!< 0x02: adc particular channel conversion end interrupt    */
	ADCIntrFull             =   0x03,               /*!< 0x03: adc FIFO full interrupt    */
	ADCIntrOver             =   0x04,               /*!< 0x04: adc FIFO overflow interrupt    */
	ADCIntrEmpty            =   0x05,               /*!< 0x05: adc FIFO empty interrupt    */
	ADCIntrDatOvw           =   0x06,               /*!< 0x06: adc data overwritten interrupt    */
	ADCIntrErr              =   0x07,               /*!< 0x07: adc error interrupt    */
	ADCIntrCompch0          =   0x08,               /*!< 0x08: adc channel 0 comparison match interrupt    */
	ADCIntrCompch1          =   0x09,               /*!< 0x09: adc channel 1 comparison match interrupt    */
	ADCIntrCompch2          =   0x0A,               /*!< 0x0A: adc channel 2 comparison match interrupt    */
	ADCIntrCompch3          =   0x0B,               /*!< 0x0B: adc channel 3 comparison match interrupt    */
	ADCIntrCompch4          =   0x0C,               /*!< 0x0C: adc channel 4 comparison match interrupt    */
	ADCIntrCompch5          =   0x0D,               /*!< 0x0D: adc channel 5 comparison match interrupt    */
	ADCIntrCompch6          =   0x0E,               /*!< 0x0E: adc channel 6 comparison match interrupt    */
	ADCIntrCompch7          =   0x0F,               /*!< 0x0F: adc channel 7 comparison match interrupt    */
};

/** \brief adc initial data structure */
typedef struct adc_init_dat_s {
	uint8_t     enable;                         /*!< Offset: 0x000   adc enable state, updated by HAL   */
	uint8_t     hw_mode;                        /*!< Offset: 0x001   adc hardware operation mode   */
	uint8_t     cvlist_len;                     /*!< Offset: 0x002   adc conversion list length, 0 for 1 entry,
                                                                     same as hardware. */
	uint8_t     it_chno_cv;                     /*!< Offset: 0x003   adc conversion channel number   */
	uint8_t     ff_tl;                          /*!< Offset: 0x004   adc fifo full threshold   */
	uint8_t     trig_timer;                     /*!< Offset: 0x005   adc conversion trigger timer   */
	uint8_t     clock_div;                      /*!< Offset: 0x006   adc input clock divider   */
	uint8_t     dma_rq_lv;                      /*!< Offset: 0x007   adc dma request level   */
	uint8_t     ref_lvl;                        /*!< Offset: 0x008   adc reference voltage level (Unused)   */
	uint8_t     use_dly;                        /*!< Offset: 0x009   adc use trig delay   */
	uint16_t    trig_dly;                       /*!< Offset: 0x00a   adc trig delay   */
	ADC_TypeDef *reg_base;                      /*!< Offset: 0x00c   adc register base address for Unify style  */
	uint8_t     vref_settle_time;               /*!< Offset: 0x00d   adc reference voltage settle time  */
	uint8_t		vref_sel_lvl;					/*!< Offset: 0x00e   adc voltage reference level (system register)  */
} adc_init_dat_t, *padc_init_dat_t;


