Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_adc.h
/** \brief adc dma information
*/
typedef struct adc_dma_info_s {
	hal_gdma_adaptor_t  *padaptor;                  /*! adc dma adaptor pointer    */
	irq_config_t        irq_config;                 /*! adc dma interrupt handler     */
	uint8_t             ch_sts;                     /*! adc dma channel status (ADC local)     */
	uint8_t             rsvd0;
	uint16_t            rsvd1;
} adc_dma_info_t, *padc_dma_info_t;

/** \brief adc user callback adaptor
*/
typedef struct adc_user_callback_adpt_s {
	VOID (*cb)(VOID *data);                         /*! adc callback function */
	uint32_t        dat;                            /*! adc callback function argument */
} adc_user_callback_adpt_t, *padc_user_callback_adpt_t;

/** \brief  hp adc pinmux enable structure.
 */
typedef union {
	uint32_t w;                             /*!< (@ 0x00000000) HP ADC pinmux enable      */

	struct {
		uint32_t adc0 : 1;                  /*!< (@ 0x00000000) ADC0 pinmux enable        */
		uint32_t adc1 : 1;                  /*!< (@ 0x00000001) ADC1 pinmux enable        */
		uint32_t adc2 : 1;                  /*!< (@ 0x00000002) ADC2 pinmux enable        */
		uint32_t adc3 : 1;                  /*!< (@ 0x00000003) ADC3 pinmux enable        */
		uint32_t adc4 : 1;                  /*!< (@ 0x00000004) ADC4 pinmux enable        */
		uint32_t adc5 : 1;                  /*!< (@ 0x00000005) ADC5 pinmux enable        */
		uint32_t adc6 : 1;                  /*!< (@ 0x00000006) ADC6 pinmux enable        */
		uint32_t adc7 : 1;                  /*!< (@ 0x00000007) ADC7 pinmux enable        */
	} b;
} hp_adc_pin_en_t, *php_adc_pin_en_t;


/** \brief adc platform related data
*/
typedef struct adc_platform_data_s {
	uint32_t        rx_dma_bound;                   /*! adc low bound to do rx-dma transmission,
                                                        if rx len is more than this bound, rx API
                                                        would change to poll mode transmission.*/
	uint32_t        tr_time_out;                    /*! adc transmission time-out count */
	hp_adc_pin_en_t pin_en;                         /*! adc channel pinmux enable */
} adc_platform_data_t, *padc_platform_data_t;


/** \brief adc user callback
*/
typedef struct adc_user_callback_s {
	adc_user_callback_adpt_t  ch0_comp;             /*! adc ch0 comparison match callback */
	adc_user_callback_adpt_t  ch1_comp;             /*! adc ch1 comparison match callback */
	adc_user_callback_adpt_t  ch2_comp;             /*! adc ch2 comparison match callback */
	adc_user_callback_adpt_t  ch3_comp;             /*! adc ch3 comparison match callback */
	adc_user_callback_adpt_t  ch4_comp;             /*! adc ch4 comparison match callback */
	adc_user_callback_adpt_t  ch5_comp;             /*! adc ch5 comparison match callback */
	adc_user_callback_adpt_t  ch6_comp;             /*! adc ch6 comparison match callback */
	adc_user_callback_adpt_t  ch7_comp;             /*! adc ch7 comparison match callback */
	adc_user_callback_adpt_t  err;                  /*! adc error callback */
	adc_user_callback_adpt_t  full;                 /*! adc fifo full callback */
	adc_user_callback_adpt_t  empty;                /*! adc fifo empty callback */
	adc_user_callback_adpt_t  cv_end;               /*! adc conversion end callback */
	adc_user_callback_adpt_t  ch_cv_end;            /*! adc particular channel conversion end callback */
	adc_user_callback_adpt_t  cvlist_end;           /*! adc conversion list end callback */
	adc_user_callback_adpt_t  rxc;                  /*! adc dma receive complete callback */
	adc_user_callback_adpt_t  wake;                 /*! adc wake up callback */
} adc_user_callback_t, *padc_user_callback_t;

/** \brief adc control adaptor
*/
typedef struct hal_adc_adapter_s {
	volatile uint8_t    status;                     /*! adc module status    */
	volatile uint8_t    use_dma;                    /*! adc module uses dma or not  */
	uint8_t             continuous_rd;              /*! adc internal flag for continuous read including DMA read */
	uint8_t             use_cali;                   /*! adc use calibration or not    */
	volatile uint32_t   err_type;                   /*! adc module error type    */
	uint32_t            cv_dat_len;                 /*! adc conversion data len, this is for receving data length, not
                                                        hardware conversion length  */
	uint16_t            *cv_dat_buf;                /*! adc conversion data buffer pointer    */
	adc_init_dat_t      init_dat;                   /*! adc initial data     */
	adc_user_callback_t usr_cb;                     /*! adc user callback     */
	adc_dma_info_t      dma_dat;                    /*! adc dma data   */
	adc_platform_data_t plft_dat;                   /*! adc platform data */
	hal_timer_adapter_t *timer_adpt;                /*! adc trigger timer adapter   */
	void (*dcache_invalidate_by_addr)(uint32_t *addr, int32_t dsize);   /*! callback function to do the D-cache invalidate  */
	void (*dcache_clean_by_addr)(uint32_t *addr, int32_t dsize);        /*! callback function to do the D-cache clean  */
	void (*dcache_clean_invalidate_by_addr)(uint32_t *addr, int32_t dsize);       /*! callback function to do the D-cache clean
                                                                                       and invalidate */
} hal_adc_adapter_t, *phal_adc_adapter_t;

/** \brief adc calibration parameters
*/
typedef struct hal_adc_cali_para_s {
	int16_t             gain_deno;
	int16_t             gain_mole;
	int16_t             offset_deno;
	int32_t             offset_mole;
	int16_t             internal_r; // this is NOT related to battery, is ADC's internal resistance
	int16_t             batt_gain_deno;
	int16_t             batt_gain_mole;
	int32_t             batt_offset_deno;
	int16_t             batt_offset_mole;
	int16_t             rsvd;
} hal_adc_cali_para_t, *phal_adc_cali_para_t;

/**
  \brief Union type to access adc params
*/
typedef union {
	__IOM int32_t w;                            /*!< word                                 */

