Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_adc.h
	struct {
		__IOM int32_t b0 : 8;                    /*!< [7..0] byte0                                       */
		__IOM int32_t b1 : 8;                    /*!< [15..8] byte1                                       */
		__IOM int32_t b2 : 8;                    /*!< [23..16] byte2                                       */
		__IOM int32_t b3 : 8;                    /*!< [31..24] byte3                                       */
	} b;                                        /*!< bit fields for adc_conf */
} adc_w_b_t, *padc_w_b_t;

extern volatile hal_adc_cali_para_t adc_cali_paras;

/*  Inline functions  */
/** \brief Description of hal_rtl_adc_chk_chidx
 *
 *    hal_rtl_adc_chk_chidx is used to check ADC channel is available or not.
 *
 *   \param[in] uint8_t ch_no:                ADC channel number.
 *   \return hal_status_t
 */
__STATIC_INLINE hal_status_t hal_rtl_adc_chk_chidx(uint8_t ch_no)
{
	if (ch_no < HP_ADC_CH_NO) {
		return HAL_OK;
	} else {
		return HAL_ERR_PARA;
	}
}

/** \brief Description of hal_rtl_adc_auto_chsw_ctrl
 *
 *    hal_rtl_adc_auto_chsw_ctrl is used to enable/disable auto mode.
 *
 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:      Pointer to ADC control adapter.
 *   \param[in] uint8_t auto_enable:                enable/ disable auto chsw.
 *   \return void
 */
__STATIC_INLINE void hal_rtl_adc_auto_chsw_ctrl(hal_adc_adapter_t *phal_adc_adapter, uint8_t auto_enable)
{
	if (auto_enable) {
		(phal_adc_adapter->init_dat.reg_base)->ADC_AUTO_CHSW_CTRL |= ADC_BIT_AUTO_CHSW_EN;
	} else {
		(phal_adc_adapter->init_dat.reg_base)->ADC_AUTO_CHSW_CTRL &= ~(ADC_BIT_AUTO_CHSW_EN);
	}
	//DBG_ADC_INFO("auto sw_ctrl stat (post-EN): %x\r\n", phal_adc_adapter->init_dat.reg_base->auto_chsw_ctrl);
}

/** \brief Description of hal_rtl_adc_get_last_item
 *
 *    hal_rtl_adc_get_last_item is used to read the last cvlist item number which \n
 *    the last conversion is executed.
 *
 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:    Pointer to ADC control adapter.
 *   \return uint32_t:            item number in cvlist
 */
__STATIC_INLINE uint32_t hal_rtl_adc_get_last_item(hal_adc_adapter_t *phal_adc_adapter)
{
	return ((phal_adc_adapter->init_dat.reg_base)->ADC_LAST_ITEM & ADC_MASK_LAST_ITEM);
}

/** \brief Description of hal_rtl_adc_get_empty_sts
 *
 *    hal_rtl_adc_get_empty_sts is used to read adc empty status.
 *
 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:          Pointer to ADC control adapter.
 *   \return uint32_t:                              0: not full; 1: full
 */
__STATIC_INLINE uint32_t hal_rtl_adc_get_empty_sts(hal_adc_adapter_t *phal_adc_adapter)
{
	if (((phal_adc_adapter->init_dat.reg_base)->ADC_STS & ADC_BIT_STS_EMPTY) >> ADC_SHIFT_STS_EMPTY)  {
		return (uint32_t)1;
	} else {
		return (uint32_t)0;
	}
}

/** \brief Description of hal_rtl_adc_reset_list
 *
 *    hal_rtl_adc_reset_list is used to reset cvlist to the default state.
 *
 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:          Pointer to ADC control adapter.
 *   \return void
 */
__STATIC_INLINE void hal_rtl_adc_reset_list(hal_adc_adapter_t *phal_adc_adapter)
{
	(phal_adc_adapter->init_dat.reg_base)->ADC_RST_LIST |= ADC_BIT_RST_LIST; // Set bit
	(phal_adc_adapter->init_dat.reg_base)->ADC_RST_LIST &= ~(ADC_BIT_RST_LIST); // Reset bit
}

#if 0 // unsure why removed
/** \brief Description of hal_adc_read_fifo_rtl8735b
 *
 *    hal_adc_read_fifo_rtl8735b is used to read the fifo register(global) without any trigger operations.
 *
 *   \param hal_adc_adapter_t *phal_adc_adapter:          Pointer to ADC control adapter.
 *   \return uint16_t:                              channel conversion data.
 */
__STATIC_INLINE uint16_t hal_adc_read_fifo_rtl8735b(hal_adc_adapter_t *phal_adc_adapter)
{
	return (uint16_t)(phal_adc_adapter->init_dat.reg_base->dat_global_b.dat);
}
#endif

/** \brief adc pin definition structure // may be defunct
*/
typedef struct hal_adc_pin_s {
	uint8_t adc_in;
	uint8_t eol;    // end of list
} hal_adc_pin_t, *phal_adc_pin_t;

/*  Function declaration   */
void hal_rtl_adc_irq_handler(void);
void hal_rtl_adc_dma_irq_handler(void);

uint8_t hal_rtl_adc_timeout_chk(hal_adc_adapter_t *phal_adc_adapter, uint32_t start_cnt);
void hal_rtl_adc_sw_cv_trig(hal_adc_adapter_t *phal_adc_adapter);
void hal_rtl_adc_irq_handle(void *data);
void hal_rtl_adc_dma_irq_handle(void *data);
hal_status_t hal_rtl_adc_pure_init(hal_adc_adapter_t *phal_adc_adapter);
hal_status_t hal_rtl_adc_pure_deinit(hal_adc_adapter_t *phal_adc_adapter);
hal_status_t hal_rtl_adc_set_in_type(hal_adc_adapter_t *phal_adc_adapter, uint8_t ch_no, uint8_t input_type);
uint8_t hal_rtl_adc_get_in_type(hal_adc_adapter_t *phal_adc_adapter, uint8_t ch_no);
hal_status_t hal_rtl_adc_set_comp_thld(hal_adc_adapter_t *phal_adc_adapter, uint8_t ch_no, uint16_t thld_high, uint16_t thld_low);
hal_status_t hal_rtl_adc_set_comp_rule(hal_adc_adapter_t *phal_adc_adapter, uint8_t ch_no, uint8_t comp_rule);
void hal_rtl_adc_clear_comp_intr_sts(hal_adc_adapter_t *phal_adc_adapter, uint8_t ch_no);
void hal_rtl_adc_intr_ctrl(hal_adc_adapter_t *phal_adc_adapter, uint8_t intr_option, uint8_t intr_enable);
void hal_rtl_adc_clear_intr_sts(hal_adc_adapter_t *phal_adc_adapter, uint8_t intr_option);
hal_status_t hal_rtl_adc_set_cvlist(hal_adc_adapter_t *phal_adc_adapter, uint8_t *cvlist, uint8_t cvlist_len);
uint8_t hal_rtl_adc_item_to_ch(hal_adc_adapter_t *phal_adc_adapter, uint8_t item_no);
void hal_rtl_adc_load_default(hal_adc_adapter_t *phal_adc_adapter);
void hal_rtl_adc_reg_irq(hal_adc_adapter_t *phal_adc_adapter, irq_handler_t handler);
void hal_rtl_adc_unreg_irq(hal_adc_adapter_t *phal_adc_adapter);
hal_status_t hal_rtl_adc_init(hal_adc_adapter_t *phal_adc_adapter);
hal_status_t hal_rtl_adc_deinit(hal_adc_adapter_t *phal_adc_adapter);
uint16_t hal_rtl_adc_single_read(hal_adc_adapter_t *phal_adc_adapter, uint8_t ch_no);
void hal_rtl_adc_clear_fifo(hal_adc_adapter_t *phal_adc_adapter);
uint16_t hal_rtl_adc_read_ch_dat(hal_adc_adapter_t *phal_adc_adapter, uint8_t ch_no, uint8_t out_raw);
hal_status_t hal_rtl_adc_read_continuous(hal_adc_adapter_t *phal_adc_adapter, uint32_t dat_len, uint16_t *dat_buf,
		uint8_t trigger_source);
//uint32_t hal_rtl_adc_gen_rand_dat32 (hal_adc_adapter_t *phal_adc_adapter, uint8_t ch_no);
//uint32_t hal_rtl_adc_exd_mod_control_rtl8735b (hal_adc_adapter_t *phal_adc_adapter, uint8_t mod_bit, uint8_t enable);
hal_status_t hal_rtl_adc_pwr_init(hal_adc_adapter_t *phal_adc_adapter);
hal_status_t hal_rtl_adc_pwr_deinit(hal_adc_adapter_t *phal_adc_adapter);

//hal_status_t hal_adc_dma_init_rtl8735b (hal_adc_adapter_t *phal_adc_adapter);
//hal_status_t hal_adc_dma_deinit_rtl8735b (hal_adc_adapter_t *phal_adc_adapter);
//hal_status_t hal_adc_read_dma_rtl8735b (hal_adc_adapter_t *phal_adc_adapter, uint32_t dat_len, uint16_t *dat_buf, uint8_t trigger_source);

int16_t hal_rtl_adc_calc_gain_deno(int16_t real_co_0, int16_t real_co_1);
int16_t hal_rtl_adc_calc_gain_mole(int16_t ideal_co_0, int16_t ideal_co_1);
int16_t hal_rtl_adc_calc_offset_deno(int16_t real_co_0, int16_t real_co_1);
int32_t hal_rtl_adc_calc_offset_mole(int16_t ideal_co_0, int16_t ideal_co_1, int16_t real_co_0, int16_t real_co_1);

uint32_t hal_rtl_adc_calc_cali_val(uint16_t adc_read_val, hal_adc_cali_para_t *phal_adc_cali_para);
void hal_rtl_adc_read_cali_param(uint16_t addr, uint8_t *param_addr, uint8_t param_len);
void hal_rtl_adc_write_cali_param(uint16_t addr, uint8_t *param_addr, uint8_t param_len);

uint16_t hal_rtl_adc_read_fifo(hal_adc_adapter_t *phal_adc_adapter, uint8_t out_raw);
/**
  \brief  The data structure of the stubs function for the ADC HAL functions in ROM
*/
typedef struct hal_adc_func_stubs_s {
	//hal_adc_pin_t *hal_adc_pin_list; // wd temp disabled
	const hal_pin_map *hal_adc_pin_list;
	uint8_t (*hal_adc_timeout_chk)(hal_adc_adapter_t *phal_adc_adapter, uint32_t start_cnt);
	void (*hal_adc_sw_cv_trig)(hal_adc_adapter_t *phal_adc_adapter);
	//hal_status_t (*hal_adc_pwr_init) (hal_adc_adapter_t *phal_adc_adapter);
	//hal_status_t (*hal_adc_pwr_deinit) (hal_adc_adapter_t *phal_adc_adapter);
	hal_status_t (*hal_adc_pure_init)(hal_adc_adapter_t *phal_adc_adapter);
	hal_status_t (*hal_adc_pure_deinit)(hal_adc_adapter_t *phal_adc_adapter);
	hal_status_t (*hal_adc_set_in_type)(hal_adc_adapter_t *phal_adc_adapter, uint8_t ch_no, uint8_t input_type);
	uint8_t (*hal_adc_get_in_type)(hal_adc_adapter_t *phal_adc_adapter, uint8_t ch_no);
	hal_status_t (*hal_adc_set_comp_thld)(hal_adc_adapter_t *phal_adc_adapter, uint8_t ch_no, uint16_t thld_high, uint16_t thld_low);
	hal_status_t (*hal_adc_set_comp_rule)(hal_adc_adapter_t *phal_adc_adapter, uint8_t ch_no, uint8_t comp_rule);
	void (*hal_adc_clear_comp_intr_sts)(hal_adc_adapter_t *phal_adc_adapter, uint8_t ch_no);
	void (*hal_adc_intr_ctrl)(hal_adc_adapter_t *phal_adc_adapter, uint8_t intr_option, uint8_t intr_enable);
	void (*hal_adc_clear_intr_sts)(hal_adc_adapter_t *phal_adc_adapter, uint8_t intr_option);
	hal_status_t (*hal_adc_set_cvlist)(hal_adc_adapter_t *phal_adc_adapter, uint8_t *cvlist, uint8_t cvlist_len);
	uint8_t (*hal_adc_item_to_ch)(hal_adc_adapter_t *phal_adc_adapter, uint8_t item_no);
	void (*hal_adc_load_default)(hal_adc_adapter_t *phal_adc_adapter);
	void (*hal_adc_reg_irq)(hal_adc_adapter_t *phal_adc_adapter, irq_handler_t handler);
	void (*hal_adc_unreg_irq)(hal_adc_adapter_t *phal_adc_adapter);
	hal_status_t (*hal_adc_init)(hal_adc_adapter_t *phal_adc_adapter);
	hal_status_t (*hal_adc_deinit)(hal_adc_adapter_t *phal_adc_adapter);
	uint16_t (*hal_adc_single_read)(hal_adc_adapter_t *phal_adc_adapter, uint8_t ch_no);
	void (*hal_adc_clear_fifo)(hal_adc_adapter_t *phal_adc_adapter);
	uint16_t (*hal_adc_read_ch_dat)(hal_adc_adapter_t *phal_adc_adapter, uint8_t ch_no, uint8_t out_raw);
	hal_status_t (*hal_adc_read_continuous)(hal_adc_adapter_t *phal_adc_adapter, uint32_t dat_len, uint16_t *dat_buf, uint8_t trigger_source);
	//uint32_t (*hal_adc_gen_rand_dat32) (hal_adc_adapter_t *phal_adc_adapter, uint8_t ch_no);
	//hal_status_t (*hal_adc_dma_init) (hal_adc_adapter_t *phal_adc_adapter);
	//hal_status_t (*hal_adc_dma_deinit) (hal_adc_adapter_t *phal_adc_adapter);
	//hal_status_t (*hal_adc_read_dma) (hal_adc_adapter_t *phal_adc_adapter, uint32_t dat_len, uint16_t *dat_buf, uint8_t trigger_source);
	void (*hal_adc_irq_handler)(void);
	void (*hal_adc_dma_irq_handler)(void);
	//uint32_t (*hal_adc_exd_mod_control) (hal_adc_adapter_t *phal_adc_adapter, uint8_t mod_bit, uint8_t enable);
	volatile hal_adc_adapter_t **phal_adc_irq_adpt;
	volatile hal_adc_cali_para_t *hal_adc_cali_para;
	int16_t (*hal_adc_calc_gain_deno)(int16_t real_co_0, int16_t real_co_1);
	int16_t (*hal_adc_calc_gain_mole)(int16_t ideal_co_0, int16_t ideal_co_1);
	int16_t (*hal_adc_calc_offset_deno)(int16_t real_co_0, int16_t real_co_1);
	int32_t (*hal_adc_calc_offset_mole)(int16_t ideal_co_0, int16_t ideal_co_1, int16_t real_co_0, int16_t real_co_1);
	uint32_t (*hal_adc_calc_cali_val)(uint16_t adc_read_val, hal_adc_cali_para_t *phal_adc_cali_para);
	void (*hal_adc_read_cali_param)(uint16_t addr, uint8_t *param_addr, uint8_t param_len);
	void (*hal_adc_write_cali_param)(uint16_t addr, uint8_t *param_addr, uint8_t param_len);
	uint16_t (*hal_adc_read_fifo)(hal_adc_adapter_t *phal_adc_adapter, uint8_t out_raw);
	uint32_t reserved[5];  // reserved space for next ROM code version function table extending.
} hal_adc_func_stubs_t;

/** @} */ /* End of group hs_hal_adc */

#ifdef  __cplusplus
}
#endif

#endif
